#include <stdio.h>
#include <windows.h>
#include <conio.h>

void moviemanage();
void roommanage();
void sellcountUI();
int myidmanage(char *id);
//影院管理端界面函数 
void cinemamanage(char *id){
	char c;
	int i=0,t;
	system("cls");
	printf("********************************************************************\n");
	printf("**************************欢迎光临银河影院**************************\n\n\n");
	printf("\033[40;35m                           影院管理端\n\n\033[0m");
	printf("                           影片演出计划管理\n");
	printf("                           影厅管理\n");
	printf("                           各影片销售统计查看\n");
	printf("                           自我ID管理\n\n");
	printf("               tips:按回车确认并进入！\n");
	printf("                    按Esc键结束程序!\n"); 
	while(1){
		c=getch();
		if(c==27){//Esc退出 
			break;
		}
		if(c==72){//向上 
			if(i>1){
				i--;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("\033[40;32m                           影片演出计划管理\n\033[0m");
					printf("                           影厅管理\n");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("\033[40;32m                           影厅管理\n\033[0m");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("                           影厅管理\n");
					printf("\033[40;32m                           各影片销售统计查看\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
			}
		}
		if(c==80){//向下 
			if(i<4){
				i++;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("\033[40;32m                           影片演出计划管理\n\033[0m");
					printf("                           影厅管理\n");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("\033[40;32m                           影厅管理\n\033[0m");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("                           影厅管理\n");
					printf("\033[40;32m                           各影片销售统计查看\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==4){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("                           影厅管理\n");
					printf("                           各影片销售统计查看\n");
					printf("\033[40;32m                           自我ID管理\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
				}
			}
		}
		if(c=='\r'&&i==1){//进入影片演出计划管理界面，调用影片演出计划管理函数 
			moviemanage();system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("\033[40;32m                           影片演出计划管理\n\033[0m");
					printf("                           影厅管理\n");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
		}
		if(c=='\r'&&i==2){//进入影厅管理界面，调用影厅管理函数 
			roommanage();system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("\033[40;32m                           影厅管理\n\033[0m");
					printf("                           各影片销售统计查看\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
		} 
		if(c=='\r'&&i==3){//进入票房查看界面，调用票房查看函数 
			sellcountUI();system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("                           影厅管理\n");
					printf("\033[40;32m                           各影片销售统计查看\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
		}
		if(c=='\r'&&i==4){//进入自我ID管理界面，调用自我id管理函数
			t=myidmanage(id); 
			if(t==1){
				return ;
			} 
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影院管理端\n\n\033[0m");
					printf("                           影片演出计划管理\n");
					printf("                           影厅管理\n");
					printf("                           各影片销售统计查看\n");
					printf("\033[40;32m                           自我ID管理\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		} 
	}
	return;
}
