#include <stdio.h>
#include <windows.h>
#include <conio.h>


void buy(char *id);
void refund(char *id);
int myidmanage(char *id);
void recentlymovie();
//客户端操作界面函数 
void client(char *id){
	char c;
	int i=0,t;
	system("cls");
	printf("********************************************************************\n");
	printf("**************************欢迎光临银河影院**************************\n\n\n");
	printf("\033[40;35m                           客户端\n\n\033[0m");
	printf("                           近期上映一览\n");
	printf("                           购票\n");
	printf("                           退票\n");
	printf("                           自我ID管理\n\n");
	printf("               tips:按回车确认并进入！\n");
	printf("                    按Esc键结束程序!\n"); 
	while(1){
		c=getch();
		if(c==27){//Esc退出 
			break;
		}
		if(c==72){//向上 
			if(i>1){
				i--;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("\033[40;32m                           近期上映一览\n\033[0m");
					printf("                           购票\n");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("\033[40;32m                           购票\n\033[0m");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("                           购票\n");
					printf("\033[40;32m                           退票\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
			}
		}
		if(c==80){//向下 
			if(i<4){
				i++;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("\033[40;32m                           近期上映一览\n\033[0m");
					printf("                           购票\n");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("\033[40;32m                           购票\n\033[0m");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("                           购票\n");
					printf("\033[40;32m                           退票\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==4){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("                           购票\n");
					printf("                           退票\n");
					printf("\033[40;32m                           自我ID管理\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
				}
			}
		}
		if(c=='\r'&&i==1){//进入近期预览界面，调用近期预览函数 
			recentlymovie();
					system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("\033[40;32m                           近期上映一览\n\033[0m");
					printf("                           购票\n");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		}
		if(c=='\r'&&i==2){//进入购票界面，调用购票函数 
			buy(id); 
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("\033[40;32m                           购票\n\033[0m");
					printf("                           退票\n");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		} 
		if(c=='\r'&&i==3){//进入退票界面，调用退票函数 
			refund(id);
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("                           购票\n");
					printf("\033[40;32m                           退票\n\033[0m");
					printf("                           自我ID管理\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		}
		if(c=='\r'&&i==4){//进入自我ID管理界面，调用自我id管理函数
			t=myidmanage(id); 
			if(t==1){
				return ;
			} system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           客户端\n\n\033[0m");
					printf("                           近期上映一览\n");
					printf("                           购票\n");
					printf("                           退票\n");
					printf("\033[40;32m                           自我ID管理\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		} 
	}
	return ;
}
