#include <stdio.h>
#include <windows.h>
#include <conio.h>


void login();
void addidUI();
//menu页 
void menu(){
		char c;
	int i=0,t;
	system("cls");
	printf("********************************************************************\n");
	printf("**************************欢迎光临银河影院**************************\n\n\n");
	printf("                               登录\n");
	printf("                               注册\n");
	printf("                               退出\n");
	printf("                     tips:按回车确认并进入！\n");
	printf("                          按Esc键结束程序!\n"); 
	while(1){
		c=getch();
		if(c==27){//Esc退出 
			break;
		}
		if(c==72){//向上 
			if(i>1){
				i--;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;32m                               登录\n\033[0m");
					printf("                               注册\n");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("                               登录\n");
					printf("\033[40;32m                               注册\n\033[0m");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("                               登录\n");
					printf("                               注册\n");
					printf("\033[40;32m                               退出\n\033[0m");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
			}
		}
		if(c==80){//向下 
			if(i<3){
				i++;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;32m                               登录\n\033[0m");
					printf("                               注册\n");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("                               登录\n");
					printf("\033[40;32m                               注册\n\033[0m");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("                               登录\n");
					printf("                               注册\n");
					printf("\033[40;32m                               退出\n\033[0m");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
				}
			}
		}
		if(c=='\r'&&i==1){//进入登录界面，调用登录函数 
			login();system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;32m                               登录\n\033[0m");
					printf("                               注册\n");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                         按Esc键结束程序!\n"); 
		}
		if(c=='\r'&&i==2){//进入注册界面，调用注册函数 
			addidUI();system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("                               登录\n");
					printf("\033[40;32m                               注册\n\033[0m");
					printf("                               退出\n");
					printf("                     tips:按回车确认并进入！\n");
					printf("                          按Esc键结束程序!\n"); 
		} 
		if(c=='\r'&&i==3){//退出 
			return;
		}
	}
	return;
} 
