#include<stdio.h>
#include<windows.h>
#include <conio.h> 

void altermovieUI();
void lookmovie();
void addmovieUI();
void deletemovieUI();
//影片演出计划管理界面
void moviemanage(){
	char c;
	int i=0,t;
	system("cls");
	printf("********************************************************************\n");
	printf("**************************欢迎光临银河影院**************************\n\n\n");
	printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
	printf("                           增加影片演出计划\n");
	printf("                           删除影片演出计划\n");
	printf("                           修改影片演出计划\n");
	printf("                           查看演出计划\n\n");
	printf("               tips:按回车确认并进入！\n");
	printf("                    按Esc键结束程序!\n"); 
	while(1){
		c=getch();
		if(c==27){//Esc退出 
			break;
		}
		if(c==72){//向上 
			if(i>1){
				i--;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("\033[40;32m                           增加影片演出计划\n\033[0m");
					printf("                           删除影片演出计划\n");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("\033[40;32m                           删除影片演出计划\n\033[0m");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("                           删除影片演出计划\n");
					printf("\033[40;32m                           修改影片演出计划\n\033[0m");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
			}
		}
		if(c==80){//向下 
			if(i<4){
				i++;
				system("cls");
				if(i==1){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("\033[40;32m                           增加影片演出计划\n\033[0m");
					printf("                           删除影片演出计划\n");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==2){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("\033[40;32m                           删除影片演出计划\n\033[0m");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==3){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("                           删除影片演出计划\n");
					printf("\033[40;32m                           修改影片演出计划\n\033[0m");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
				}
				if(i==4){
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("                           删除影片演出计划\n");
					printf("                           修改影片演出计划\n");
					printf("\033[40;32m                           查看演出计划\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
				}
			}
		}
		if(c=='\r'&&i==1){//进入影片演出计划增加界面，调用影片演出计划增加函数 
			addmovieUI();
					system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("\033[40;32m                           增加影片演出计划\n\033[0m");
					printf("                           删除影片演出计划\n");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n"); 
		}
		if(c=='\r'&&i==2){//进入影片演出计划删除界面，调用影片演出计划删除函数 
			deletemovieUI();
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("\033[40;32m                           删除影片演出计划\n\033[0m");
					printf("                           修改影片演出计划\n");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		} 
		if(c=='\r'&&i==3){//进入影片演出计划修改界面，调用影片演出计划修改函数 
			altermovieUI();
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("                           删除影片演出计划\n");
					printf("\033[40;32m                           修改影片演出计划\n\033[0m");
					printf("                           查看演出计划\n\n");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		}
		if(c=='\r'&&i==4){//进入演出计划查看界面，调用演出计划查看函数
			lookmovie();
			system("cls");
					printf("********************************************************************\n");
					printf("**************************欢迎光临银河影院**************************\n\n\n");
					printf("\033[40;35m                           影片演出计划管理\n\n\033[0m");
					printf("                           增加影片演出计划\n");
					printf("                           删除影片演出计划\n");
					printf("                           修改影片演出计划\n");
					printf("\033[40;32m                           查看演出计划\n\n\033[0m");
					printf("               tips:按回车确认并进入！\n");
					printf("                    按Esc键结束程序!\n");
		} 
	}
	return;
}
